In [6]:
import pandas as pd
import numpy as np

In [7]:
list=[20,19,20,19,18,23,22,23,24,19,20,25]
a=np.array(list)
s=pd.Series(list)

In [8]:
np.unique(a)

array([18, 19, 20, 22, 23, 24, 25])

In [9]:
s.unique()

array([20, 19, 18, 23, 22, 24, 25], dtype=int64)

In [13]:
x=s.value_counts()

In [16]:
x

20    3
19    3
23    2
25    1
24    1
22    1
18    1
dtype: int64

In [15]:
s.mode()

0    19
1    20
dtype: int64

In [17]:
df=pd.DataFrame([['A',10,5],['B',11,3],['C',14,2]])

In [18]:
df

   0   1  2
0  A  10  5
1  B  11  3
2  C  14  2

In [19]:
df=pd.DataFrame([['A',10,5],['B',11,3],['C',14,2]],columns=['name','age','roll'])

In [20]:
df

  name  age  roll
0    A   10     5
1    B   11     3
2    C   14     2

In [21]:
df=pd.DataFrame([['A',10,5],['B',11,3],['C',14,2]],columns=['name','age','roll'],index=['r1','r2','r3'])

In [22]:
df

   name  age  roll
r1    A   10     5
r2    B   11     3
r3    C   14     2

In [35]:
df=pd.DataFrame({'name':['P','Q','R'],'my age':[10,11,12],'roll':[1,2,3]})

In [36]:
df

   my age name  roll
0      10    P     1
1      11    Q     2
2      12    R     3

In [42]:
df.name

0    P
1    Q
2    R
Name: name, dtype: object

In [43]:
df['name']

0    P
1    Q
2    R
Name: name, dtype: object

In [46]:
#df.my age

In [47]:
df['my age']

0    10
1    11
2    12
Name: my age, dtype: int64

In [48]:
df

   my age name  roll
0      10    P     1
1      11    Q     2
2      12    R     3

In [50]:
df['marks']=[600,500,650]

In [51]:
df

   my age name  roll  marks
0      10    P     1    600
1      11    Q     2    500
2      12    R     3    650

In [52]:
df['name']=['virat','rohit','yuvi']

In [53]:
df

   my age   name  roll  marks
0      10  virat     1    600
1      11  rohit     2    500
2      12   yuvi     3    650

In [54]:
df.insert(0,'clg',['c1','c2','c3'])

In [55]:
df

  clg  my age   name  roll  marks
0  c1      10  virat     1    600
1  c2      11  rohit     2    500
2  c3      12   yuvi     3    650

In [60]:
df.drop('roll',axis=1,inplace=True)#axis 1=columnwise

In [62]:
df.drop(1,axis=0)#axis 0=row wise

  clg  my age   name  marks
0  c1      10  virat    600
2  c3      12   yuvi    650

In [63]:
df

  clg  my age   name  marks
0  c1      10  virat    600
1  c2      11  rohit    500
2  c3      12   yuvi    650